// Дано целое число. Выведите в консоль первую цифру этого числа.
public class Six {
    public static void main(String[] args) {
        int number = 123456;
        System.out.println(String.valueOf(number).charAt(0)); // Первая цифра
    }
}
